#!/bin/bash
#########################################定义变量##########################################################
#定义时间
MYDATE=`date +%Y-%m-%d`
#echo $MYDATE
#数据导出路径
dump_data_xls="/root/export_cluster_"$MYDATE"_"
dump_data_xls_suffix=.xls
#echo $dump_data_xls
#数据库连接信息
#-A:不去预读全部数据表信息，这样可以解决在数据表很多的时候卡死的问题
#-N:获取的数据省略列明，在实际使用中根据情况而定
MYSQL=" mysql -h127.0.0.1 -uinspurCloudDB -p123456a? --default-character-set=utf8 -A -N"
select_cluster_sql="   select t.cluster_id,
                              t.cluster_name 
                       from   cloudos_db.t_rs_cluster t
                   "
#########################################定义变量##########################################################





#########################################抓取es数据#########################################################
#调用java完成es数据抓取到数据库中,需要实现增量数据的抓取
#chmod a+x aa.jar
#java -jar aa.jar
#########################################抓取es数据#########################################################






#########################################格式化数据#########################################################

#echo "$select_cluster_sql"
#执行数据导出
cluster_data_result="$($MYSQL -e "${select_cluster_sql}")"

:<<!
for d in $cluster_data_result; do
	echo "当前数据的集群id为 $d"
done
echo "$cluster_data_result"
echo -e "$cluster_data_result" > $dump_data_xls
!

while read -a row
do
	echo "集群ID：${row[0]}，集群名称：${row[1]}"
	#根据集群ID获取其对应的性能信息，并且输出到指定文件中
	cluster_id=${row[0]}
	file_name=${dump_data_xls}${cluster_id}${dump_data_xls_suffix}
	#echo -e $file_name
	#touch $file_name
done< <(echo -e "$cluster_data_result")
#########################################格式化数据#########################################################


#########################################数据预测###########################################################
#调用python脚本预测数据
#chmod a+x aaa.py
#python aaa.py



#########################################数据预测###########################################################



#########################################输出预测数据#######################################################
#把预测后的数据写入数据库
#########################################输出预测数据#######################################################